app/Http/View/Composers/MessageComposer.php

    public function compose(View $view)
    {
        if (!Auth::guest() && !$view->offsetExists('messageCount')) {
            $messages = user()->conversationNotifications()->count();
---
select count(*) as aggregate from `conversation_notifications` where `conversation_notifications`.`user_id` = 2 and `conversation_notifications`.`user_id` is not null