app/Http/View/Composers/PendingReportComposer.php

    public function compose(View $view)
    {
        $pendingReportCount = Cache::remember('pending_report', 300, function () {
            return Report::whereNull('resolved_at')->count();
---
select count(*) as aggregate from `reports` where `resolved_at` is null