app/Http/Controllers/Controller.php

    protected function versions(): mixed
    {
        return Cache::remember('versions', 60 * 10, function () {
            return MinecraftVersion::orderBy('released_at')->get();
        });
---
select * from `versions` order by `released_at` asc

    protected function finalStorage(User $user, UploadedFile $uploadedFile, bool $isDeletable, Image $image, string $extension): File
    {
        $fileName = Str::random(40);
        $path = $user->getImagesPath();
        $file = $path . $fileName . '.' . $extension;

        $disk = Storage::disk('public');
        $disk->makeDirectory($path);
        if ($extension === 'gif') {
            $uploadedFile->storeAs($path, $fileName . '.' . $extension, 'public');
        } else {
            $disk->put($file, $image->encode(null, 75));
        }

        $size = $disk->size($file);

        return File::create(['user_id' => $user->id, 'file_extension' => $extension, 'file_size' => $size, 'file_name' => $fileName, 'is_deletable' => $isDeletable,]);
---
insert into `files` (`user_id`, `file_extension`, `file_size`, `file_name`, `is_deletable`, `file_upload_name`, `updated_at`, `created_at`) values (2, 'jpg', 1613, 'zFCNKWotsxgcqPhn9uRRRguBDnKkm9sECC3BsD4d', 0, '88d83dadc5562b8096a3b35d830ddf86.jpg', '2024-06-21 14:02:09', '2024-06-21 14:02:09')

    protected function storeFile(User $user, Resource $resource, UploadedFile $file) : File
    {
        $fileName = Str::random(40);
        $extension = $file->guessExtension();
        $path = $resource->id;

        $filePath = "$path/$fileName.$extension";

        $disk = Storage::disk('plugins');
        $file->storeAs($path, "$fileName.$extension", "plugins");

        $size = $disk->size($filePath);

        return File::create(['user_id' => $user->id, 'file_extension' => $extension, 'file_size' => $size, 'file_name' => $fileName, 'is_deletable' => false]);
---
insert into `files` (`user_id`, `file_extension`, `file_size`, `file_name`, `is_deletable`, `updated_at`, `created_at`) values (2, 'jar', 12965, 'm4x9HH69cOgsITPMGFS5ROd20wKumXY33dRel2Ki', 0, '2024-06-21 14:02:09', '2024-06-21 14:02:09')