app/Http/Controllers/Resource/DashboardController.php

select `payment_payments`.* from `payment_payments` inner join `resource_resources` on `payment_payments`.`content_id` = `resource_resources`.`id` where `resource_resources`.`user_id` = 2 and `payment_payments`.`type` = 0 and `payment_payments`.`status` = 'PAID'
select * from `resource_resources` where `resource_resources`.`user_id` = 2 and `resource_resources`.`user_id` is not null
select sum(`resource_versions`.`download`) as aggregate from `resource_versions` inner join `resource_resources` on `resource_versions`.`resource_id` = `resource_resources`.`id` where `resource_resources`.`user_id` = 2
select * from `user_payment_infos` where `user_payment_infos`.`user_id` = 2 and `user_payment_infos`.`user_id` is not null limit 1
---
    public function index(): Application|View|Factory|\Illuminate\Contracts\Foundation\Application
    {
        $user = user();

        $cacheKey = 'dashboard_data_user_' . $user->id;

        $data = Cache::remember($cacheKey, 600, function () use ($user) {
            $currency = $user->paymentInfo?->currency->currency ?? 'eur';
            $resources = $user->resources->count();
            $payments = Payment::select('payment_payments.*')
                ->join('resource_resources', 'payment_payments.content_id', '=', 'resource_resources.id')
                ->where('resource_resources.user_id', $user->id) // L'identifiant de l'utilisateur qui possède la ressource
                ->where('payment_payments.type', Payment::TYPE_RESOURCE) // Assurez-vous que le type de paiement est pour les ressources
                ->where('payment_payments.status', Payment::STATUS_PAID) // Vous pouvez ajuster ce critère en fonction de vos besoins
                ->get();

            $earnMoney = $payments->sum('price');

            $download = Version::join('resource_resources', 'resource_versions.resource_id', '=', 'resource_resources.id')
                ->where('resource_resources.user_id', $user->id) // Filtrer les ressources appartenant à l'utilisateur
                ->sum('resource_versions.download'); // Somme de la colonne `download`
            return [
                'currency' => $currency,
                'download' => $download,
                'payments' => $payments->count(),
                'resources' => $resources,
                'earnMoney' => $earnMoney
            ];