app/Http/Controllers/Resource/ResourceCreateController.php


        $price = $request['price'];

        $resource = Resource::create(['category_id' => $category->id, 'user_id' => $user->id, 'image_id' => $media->id, 'name' => $request['name_resource'], 'price' => min(100, max(0, $price)), 'description' => $request['description'], 'tag' => $request['tags'], 'is_display' => true, 'is_pending' => true, 'contributors' => $request['contributors'], 'source_code_link' => $request['link_source'], 'donation_link' => $request['link_donation'], 'discord_server_id' => $request['discord'], 'bstats_id' => $request['bstats_id'], 'required_dependencies' => $request['required_dependencies'],
            'optional_dependencies' => $request['optional_dependencies'], 'link_information' => $request['link_information'], 'link_support' => $request['link_support'], 'lang_support' => $request['lang_support'], 'versions' => implode(",", $request['versions'] ?? []), 'version_id' => null,]);
---
insert into `resource_resources` (`category_id`, `user_id`, `image_id`, `name`, `price`, `description`, `tag`, `is_display`, `is_pending`, `contributors`, `source_code_link`, `donation_link`, `discord_server_id`, `bstats_id`, `required_dependencies`, `optional_dependencies`, `link_information`, `link_support`, `lang_support`, `versions`, `version_id`, `updated_at`, `created_at`) values (1, 2, 6, 'test2', 0, 'bipbop', 'tags', 1, 1, '', '', '', '', '', '', '', '', '', '', '1', '', '2024-06-21 14:02:09', '2024-06-21 14:02:09')