app/Http/Controllers/Resource/ResourcePagination.php

select `users`.`name`, `users`.`id`, `users`.`profile_photo_path`, `users`.`user_role_id`, `users`.`name_color_id`, COUNT(`resource_resources`.`id`) AS `resource` from `users` inner join `resource_resources` on `resource_resources`.`user_id` = `users`.`id` where `resource_resources`.`is_display` = 1 and `resource_resources`.`is_pending` = 0 group by `resource_resources`.`user_id`, `users`.`id`, `users`.`name`, `users`.`profile_photo_path`, `users`.`user_role_id`, `users`.`name_color_id` order by `resource` desc limit 5
---
    public static function mostResources()
    {
        return User::select('users.name', 'users.id', 'users.profile_photo_path', 'users.user_role_id', 'users.name_color_id')
            ->addSelect(DB::raw("COUNT(`resource_resources`.`id`) AS `resource`"))
            ->join('resource_resources', 'resource_resources.user_id', '=', 'users.id')
            ->where('resource_resources.is_display', true)
            ->where('resource_resources.is_pending', false)
            ->groupBy('resource_resources.user_id')
            ->groupBy('users.id')
            ->groupBy('users.name')
            ->groupBy('users.profile_photo_path')
            ->groupBy('users.user_role_id')
            ->groupBy('users.name_color_id')
            ->orderBy('resource', 'DESC')
            ->limit(5)->get();

select * from `resource_versions` where `resource_versions`.`id` in (2, 3)
select `resource_resources`.* from `resource_resources` left join `resource_versions` on `resource_resources`.`version_id` = `resource_versions`.`id` where `resource_resources`.`is_pending` = 1 and `resource_resources`.`user_id` = 2 or `resource_resources`.`is_pending` = 0 and `resource_resources`.`is_display` = 1 and `resource_resources`.`user_id` = 2 order by `resource_versions`.`created_at` desc limit 15 offset 0
select count(*) as aggregate from `resource_resources` left join `resource_versions` on `resource_resources`.`version_id` = `resource_versions`.`id` where `resource_resources`.`is_pending` = 1 and `resource_resources`.`user_id` = 2 or `resource_resources`.`is_pending` = 0 and `resource_resources`.`is_display` = 1 and `resource_resources`.`user_id` = 2
---
    public static function paginateAuthor(User $user): LengthAwarePaginator
    {
        return Resource::select("resource_resources.*")
            ->with('version')
            ->with('category')
            ->with('icon')
            ->leftJoin('resource_versions', 'resource_resources.version_id', '=', 'resource_versions.id')
            ->when(!Auth::guest(), function ($query) {
                $currentUser = Auth::user();
                $query->where('resource_resources.is_pending', true)->where('resource_resources.user_id', $currentUser->id)
                    ->orWhere('resource_resources.is_pending', false);
            }, function ($query) {
                $query->where('resource_resources.is_pending', false);
            })
            ->where('resource_resources.is_display', true)
            ->where('resource_resources.user_id', $user->id)
            ->orderBy('resource_versions.created_at', 'DESC')
            ->paginate();

select * from `resource_versions` where `resource_versions`.`id` in (1, 2)
select `resource_resources`.* from `resource_resources` left join `resource_versions` on `resource_resources`.`version_id` = `resource_versions`.`id` left join `users` on `users`.`id` = `resource_resources`.`user_id` where `resource_resources`.`is_pending` = 1 or `resource_resources`.`is_pending` = 0 and `resource_resources`.`is_display` = 1 order by `resource_versions`.`created_at` desc limit 15 offset 0
select count(*) as aggregate from `resource_resources` left join `resource_versions` on `resource_resources`.`version_id` = `resource_versions`.`id` left join `users` on `users`.`id` = `resource_resources`.`user_id` where `resource_resources`.`is_pending` = 1 or `resource_resources`.`is_pending` = 0 and `resource_resources`.`is_display` = 1
---
    public static function paginate(Category $category = null): mixed
    {
        $search = request()->input('search');

        return Resource::select("resource_resources.*")
            ->with('version')
            ->with('category')
            ->with('icon')
            ->leftJoin('resource_versions', 'resource_resources.version_id', '=', 'resource_versions.id')
            ->leftJoin('users', 'users.id', '=', 'resource_resources.user_id')
            ->when($search, function ($query) use ($search) {
                $query->where(function ($query) use ($search) {
                    $query->where('resource_resources.name', 'like', '%' . $search . '%');
                    $query->orWhere('resource_resources.tag', 'like', '%' . $search . '%');
                    $query->orWhere('users.name', 'like', '%' . $search . '%');
                });
            })
            ->when($category, function ($query) use ($category) {
                $query->where('resource_resources.category_id', $category->id);
            })
            ->when(!Auth::guest(), function ($query) {
                $user = user();
                if ($user->isAdmin()) {
                    $query->where('resource_resources.is_pending', true)->orWhere('resource_resources.is_pending', false);
                } else {
                    $query->where('resource_resources.is_pending', true)->where('resource_resources.user_id', $user->id)
                        ->orWhere('resource_resources.is_pending', false);
                }
            }, function ($query) {
                $query->where('resource_resources.is_pending', false);
            })
            ->where('resource_resources.is_display', true)
            ->orderBy('resource_versions.created_at', 'DESC')
            ->paginate();

select * from `discord_notifications` where `event` = 'event.resource.created' and `user_id` = 2 and `is_valid` = 1
---
    public static function sendDiscordWebhook(Resource $resource, User $user, string $event): void
    {
        $webhooks = DiscordNotification::where('event', $event)->where('user_id', $resource->user_id)->where('is_valid', true)->get();