app/Models/UserLog.php

insert into `user_logs` (`user_id`, `action`, `color`, `icon`, `type`, `ipv4`, `updated_at`, `created_at`) values (2, 'Création de la ressource test2.3', '#3CB371', 'fas fa-file-archive', 1, '0.0.0.0', '2024-06-21 14:02:09', '2024-06-21 14:02:09')
---
    public static function make(User $user, string $action, string $color, string $icon, int $type = self::TYPE_DEFAULT): UserLog
    {
        $ipV4 = getIpV4();
        return self::create([
            'user_id' => $user->id,
            'action' => $action,
            'color' => $color,
            'icon' => $icon,
            'type' => $type,
            'ipv4' => $ipV4,
        ]);