app/Models/User.php

select * from `user_roles` where `user_roles`.`id` = 6 limit 1
---
    public function hasAccess(Resource $resource, bool $useCache = true): bool
    {
        if ($this->cache('role')->isModerator() || $this->id === $resource->user_id || $resource->price == 0) {
            return true;
        }

        if ($useCache) {
            return Cache::remember("user.access::$this->id", 86400, function () use ($resource) {
                if (env('ZMENUPLUS_RESOURCE_ID') == $resource->id && $this->role->isPremium()) return true;
                return Access::where('user_id', $this->id)->where('resource_id', $resource->id)->count() > 0;
            });

select * from `resource_accesses` where `resource_accesses`.`user_id` = 2 and `resource_accesses`.`user_id` is not null
---
    function countAccess(): int
    {
        return Cache::remember("user.resource_access::$this->id", 86400, function () {
            return $this->accesses->count();
        });