app/Models/Video.php

    public static function getRandomVideo()
    {
        return self::inRandomOrder()->first();
---
select * from `videos` order by RAND() limit 1