app/Http/Controllers/Admin/IndexController.php

    public function index(): \Illuminate\Foundation\Application|View|Factory|Application
    {
        $payments = Payment::where('status', Payment::STATUS_PAID)->sum('price');
        return view('admins.dashboard', [
            'users' => User::count(),
            'resources' => Resource::count(),
            'folders' => Folder::count(),
            'inventories' => Inventory::count(),
            'payments' => $payments,
            'newUsersPerMonths' => Charts::countByMonths(User::query()),
            'newUsersPerDays' => Charts::countByDays(User::query(), null, 14),
        ]);
---
select count(*) as aggregate from `users`
select count(*) as aggregate from `folders`
select count(*) as aggregate from `inventories`