app/Http/Controllers/Admin/ResourceController.php

    public function accept(Resource $resource): RedirectResponse
    {
        $resource->update([
            'is_pending' => false,
            'created_at' => Carbon::now(),
            'updated_at' => Carbon::now()
        ]);

        createAlert($resource->user_id, $resource->name, AlertUser::ICON_SUCCESS, AlertUser::SUCCESS, 'alerts.alerts.resources.accepted');
        userLog("Ressource accepté $resource->name ($resource->id)", UserLog::COLOR_SUCCESS, UserLog::ICON_ADD);

        Cache::forget('pending_resources');
        Cache::forget('resources:mostResources');

        $webhooks = DiscordNotification::where('event', 'event.resource.created')->where('user_id', env('ADMIN_DISCORD_ID'))->where('is_valid', true)->get();
---
select * from `discord_notifications` where `event` = 'event.resource.created' and `user_id` = '1' and `is_valid` = 1